workstation/openfoam-master-tutorials/tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_3phase/0.orig/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1 0);

boundaryField
{
    inlet
    {
        type            mapped;
        field           U.gas;
        setAverage      1;
        average         (0 1 0);
        interpolationScheme cell;
        value           uniform (0 1 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           uniform (0 1 0);
    }

    wall1
    {
        type            slip;
    }

    wall2
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
